HloModule train_step_func_pipeshard_parallel_mesh_0-0_apply_grad, input_output_alias={ {0}: (0, {}, may-alias), {1}: (1, {}, may-alias), {2}: (2, {}, may-alias), {3}: (3, {}, may-alias), {4}: (4, {}, may-alias), {5}: (5, {}, may-alias), {6}: (6, {}, may-alias), {7}: (7, {}, may-alias), {8}: (8, {}, may-alias), {9}: (9, {}, may-alias), {10}: (10, {}, may-alias), {11}: (11, {}, may-alias), {12}: (12, {}, may-alias), {13}: (13, {}, may-alias), {14}: (14, {}, may-alias), {15}: (15, {}, may-alias), {16}: (16, {}, may-alias), {17}: (17, {}, may-alias), {18}: (18, {}, may-alias), {19}: (19, {}, may-alias), {20}: (20, {}, may-alias), {21}: (21, {}, may-alias), {22}: (22, {}, may-alias), {23}: (23, {}, may-alias), {24}: (24, {}, may-alias), {25}: (25, {}, may-alias), {26}: (26, {}, may-alias), {27}: (27, {}, may-alias), {28}: (28, {}, may-alias), {29}: (29, {}, may-alias), {30}: (30, {}, may-alias), {31}: (31, {}, may-alias), {32}: (32, {}, may-alias), {33}: (33, {}, may-alias), {34}: (34, {}, may-alias), {35}: (35, {}, may-alias), {36}: (36, {}, may-alias), {37}: (37, {}, may-alias), {38}: (38, {}, may-alias), {39}: (39, {}, may-alias), {40}: (40, {}, may-alias), {41}: (41, {}, may-alias), {42}: (42, {}, may-alias), {43}: (43, {}, may-alias), {44}: (44, {}, may-alias), {45}: (45, {}, may-alias), {46}: (46, {}, may-alias), {47}: (47, {}, may-alias), {48}: (48, {}, may-alias), {49}: (49, {}, may-alias), {50}: (50, {}, may-alias), {51}: (51, {}, may-alias), {52}: (52, {}, may-alias), {53}: (53, {}, may-alias), {54}: (54, {}, may-alias), {55}: (55, {}, may-alias), {56}: (56, {}, may-alias), {57}: (57, {}, may-alias), {58}: (58, {}, may-alias), {59}: (59, {}, may-alias), {60}: (60, {}, may-alias), {61}: (61, {}, may-alias), {62}: (62, {}, may-alias), {63}: (63, {}, may-alias), {64}: (64, {}, may-alias), {65}: (65, {}, may-alias), {66}: (66, {}, may-alias), {67}: (67, {}, may-alias), {68}: (68, {}, may-alias), {69}: (69, {}, may-alias), {70}: (70, {}, may-alias), {71}: (71, {}, may-alias), {72}: (72, {}, may-alias), {73}: (73, {}, may-alias), {74}: (74, {}, may-alias), {75}: (75, {}, may-alias), {76}: (76, {}, may-alias), {77}: (77, {}, may-alias), {78}: (78, {}, may-alias), {79}: (79, {}, may-alias), {80}: (80, {}, may-alias), {81}: (81, {}, may-alias), {82}: (82, {}, may-alias), {83}: (83, {}, may-alias), {84}: (84, {}, may-alias), {85}: (85, {}, may-alias), {86}: (86, {}, may-alias), {87}: (87, {}, may-alias), {88}: (88, {}, may-alias), {89}: (89, {}, may-alias), {90}: (90, {}, may-alias), {91}: (91, {}, may-alias), {92}: (92, {}, may-alias), {93}: (93, {}, may-alias), {94}: (94, {}, may-alias), {95}: (95, {}, may-alias), {96}: (96, {}, may-alias), {97}: (97, {}, may-alias), {98}: (98, {}, may-alias), {99}: (99, {}, may-alias), {100}: (100, {}, may-alias), {101}: (101, {}, may-alias), {102}: (102, {}, may-alias), {103}: (103, {}, may-alias), {104}: (104, {}, may-alias), {105}: (105, {}, may-alias), {106}: (106, {}, may-alias), {107}: (107, {}, may-alias), {108}: (108, {}, may-alias), {109}: (109, {}, may-alias), {110}: (110, {}, may-alias), {111}: (111, {}, may-alias), {112}: (112, {}, may-alias), {113}: (113, {}, may-alias), {114}: (114, {}, may-alias), {115}: (115, {}, may-alias), {116}: (116, {}, may-alias), {117}: (117, {}, may-alias), {118}: (118, {}, may-alias), {119}: (119, {}, may-alias), {120}: (120, {}, may-alias), {121}: (121, {}, may-alias), {122}: (122, {}, may-alias), {123}: (123, {}, may-alias), {124}: (124, {}, may-alias), {125}: (125, {}, may-alias), {126}: (126, {}, may-alias), {127}: (127, {}, may-alias), {128}: (128, {}, may-alias), {129}: (129, {}, may-alias), {130}: (130, {}, may-alias), {131}: (131, {}, may-alias), {132}: (132, {}, may-alias), {133}: (133, {}, may-alias), {134}: (134, {}, may-alias), {135}: (135, {}, may-alias), {136}: (136, {}, may-alias), {137}: (137, {}, may-alias), {138}: (138, {}, may-alias), {139}: (139, {}, may-alias), {140}: (140, {}, may-alias), {141}: (141, {}, may-alias), {142}: (142, {}, may-alias), {143}: (143, {}, may-alias), {144}: (144, {}, may-alias), {145}: (145, {}, may-alias), {146}: (146, {}, may-alias), {147}: (147, {}, may-alias), {148}: (148, {}, may-alias), {149}: (149, {}, may-alias), {150}: (150, {}, may-alias), {151}: (151, {}, may-alias), {152}: (152, {}, may-alias), {153}: (153, {}, may-alias), {154}: (154, {}, may-alias), {155}: (155, {}, may-alias), {156}: (156, {}, may-alias), {157}: (157, {}, may-alias), {158}: (158, {}, may-alias), {159}: (159, {}, may-alias), {160}: (160, {}, may-alias), {161}: (161, {}, may-alias), {162}: (162, {}, may-alias), {163}: (163, {}, may-alias), {164}: (164, {}, may-alias), {165}: (165, {}, may-alias), {166}: (166, {}, may-alias), {167}: (167, {}, may-alias), {168}: (168, {}, may-alias), {169}: (169, {}, may-alias), {170}: (170, {}, may-alias), {171}: (171, {}, may-alias), {172}: (172, {}, may-alias), {173}: (173, {}, may-alias), {174}: (174, {}, may-alias), {175}: (175, {}, may-alias), {176}: (176, {}, may-alias), {177}: (177, {}, may-alias), {178}: (178, {}, may-alias), {179}: (179, {}, may-alias), {180}: (180, {}, may-alias), {181}: (181, {}, may-alias), {182}: (182, {}, may-alias), {183}: (183, {}, may-alias), {184}: (184, {}, may-alias), {185}: (185, {}, may-alias), {186}: (186, {}, may-alias), {187}: (187, {}, may-alias), {188}: (188, {}, may-alias), {189}: (189, {}, may-alias), {190}: (190, {}, may-alias), {191}: (191, {}, may-alias), {192}: (192, {}, may-alias), {193}: (193, {}, may-alias), {194}: (194, {}, may-alias), {195}: (195, {}, may-alias), {196}: (196, {}, may-alias), {197}: (197, {}, may-alias), {198}: (198, {}, may-alias), {199}: (199, {}, may-alias), {200}: (200, {}, may-alias), {201}: (201, {}, may-alias), {202}: (202, {}, may-alias), {203}: (203, {}, may-alias), {204}: (204, {}, may-alias), {205}: (205, {}, may-alias), {206}: (206, {}, may-alias), {207}: (207, {}, may-alias), {208}: (208, {}, may-alias), {209}: (209, {}, may-alias), {210}: (210, {}, may-alias), {211}: (211, {}, may-alias), {212}: (212, {}, may-alias), {213}: (213, {}, may-alias), {214}: (214, {}, may-alias), {215}: (215, {}, may-alias), {216}: (216, {}, may-alias), {217}: (217, {}, may-alias), {218}: (218, {}, may-alias), {219}: (219, {}, may-alias), {220}: (220, {}, may-alias), {221}: (221, {}, may-alias), {222}: (222, {}, may-alias), {223}: (223, {}, may-alias), {224}: (224, {}, may-alias) }, entry_computation_layout={(f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,224,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[1,1,224,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,896,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,896,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,896,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,1792,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[224]{0},f32[224]{0},f32[7,7,3,224]{3,2,1,0},s32[],f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,224,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[1,1,224,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,896,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,896,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,896,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,1792,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[224]{0},f32[224]{0},f32[7,7,3,224]{3,2,1,0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[896]{0},f32[896]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[3584]{0},f32[3584]{0},f32[224]{0},f32[224]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,224,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[1,1,224,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,896,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1,1,896,224]{3,2,1,0},f32[3,3,224,448]{3,2,1,0},f32[1,1,448,896]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,896,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,448]{3,2,1,0},f32[3,3,448,896]{3,2,1,0},f32[1,1,896,1792]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,1792,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[224]{0},f32[224]{0},f32[7,7,3,224]{3,2,1,0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[896]{0},f32[896]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[224]{0},f32[224]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[448]{0},f32[448]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[3584]{0},f32[3584]{0},f32[224]{0},f32[224]{0})->(f32[224]{0}, f32[224]{0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, /*index=5*/f32[896]{0}, f32[1,1,224,224]{3,2,1,0}, f32[3,3,224,448]{3,2,1,0}, f32[1,1,448,896]{3,2,1,0}, f32[1,1,224,896]{3,2,1,0}, /*index=10*/f32[896]{0}, f32[896]{0}, f32[224]{0}, f32[224]{0}, f32[448]{0}, /*index=15*/f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1,1,896,224]{3,2,1,0}, f32[3,3,224,448]{3,2,1,0}, /*index=20*/f32[1,1,448,896]{3,2,1,0}, f32[224]{0}, f32[224]{0}, f32[448]{0}, f32[448]{0}, /*index=25*/f32[896]{0}, f32[896]{0}, f32[1,1,896,224]{3,2,1,0}, f32[3,3,224,448]{3,2,1,0}, f32[1,1,448,896]{3,2,1,0}, /*index=30*/f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=35*/f32[1792]{0}, f32[1,1,896,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, /*index=40*/f32[1792]{0}, f32[1792]{0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, /*index=45*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[1,1,1792,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, /*index=50*/f32[1,1,896,1792]{3,2,1,0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, /*index=55*/f32[1792]{0}, f32[1792]{0}, f32[1,1,1792,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, /*index=60*/f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=65*/f32[1792]{0}, f32[1,1,1792,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, f32[896]{0}, /*index=70*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, /*index=75*/f32[1,1,1792,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[3584]{0}, /*index=80*/f32[3584]{0}, f32[224]{0}, f32[224]{0}, f32[7,7,3,224]{3,2,1,0}, s32[], /*index=85*/f32[224]{0}, f32[224]{0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, /*index=90*/f32[896]{0}, f32[1,1,224,224]{3,2,1,0}, f32[3,3,224,448]{3,2,1,0}, f32[1,1,448,896]{3,2,1,0}, f32[1,1,224,896]{3,2,1,0}, /*index=95*/f32[896]{0}, f32[896]{0}, f32[224]{0}, f32[224]{0}, f32[448]{0}, /*index=100*/f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1,1,896,224]{3,2,1,0}, f32[3,3,224,448]{3,2,1,0}, /*index=105*/f32[1,1,448,896]{3,2,1,0}, f32[224]{0}, f32[224]{0}, f32[448]{0}, f32[448]{0}, /*index=110*/f32[896]{0}, f32[896]{0}, f32[1,1,896,224]{3,2,1,0}, f32[3,3,224,448]{3,2,1,0}, f32[1,1,448,896]{3,2,1,0}, /*index=115*/f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=120*/f32[1792]{0}, f32[1,1,896,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, /*index=125*/f32[1792]{0}, f32[1792]{0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, /*index=130*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[1,1,1792,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, /*index=135*/f32[1,1,896,1792]{3,2,1,0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, /*index=140*/f32[1792]{0}, f32[1792]{0}, f32[1,1,1792,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, /*index=145*/f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=150*/f32[1792]{0}, f32[1,1,1792,448]{3,2,1,0}, f32[3,3,448,896]{3,2,1,0}, f32[1,1,896,1792]{3,2,1,0}, f32[896]{0}, /*index=155*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, /*index=160*/f32[1,1,1792,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[3584]{0}, /*index=165*/f32[3584]{0}, f32[224]{0}, f32[224]{0}, f32[7,7,3,224]{3,2,1,0}, f32[224]{0}, /*index=170*/f32[224]{0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, /*index=175*/f32[896]{0}, f32[896]{0}, f32[224]{0}, f32[224]{0}, f32[448]{0}, /*index=180*/f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[224]{0}, f32[224]{0}, /*index=185*/f32[448]{0}, f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[448]{0}, /*index=190*/f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, /*index=195*/f32[1792]{0}, f32[1792]{0}, f32[448]{0}, f32[448]{0}, f32[896]{0}, /*index=200*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[448]{0}, f32[448]{0}, /*index=205*/f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[448]{0}, /*index=210*/f32[448]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, /*index=215*/f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=220*/f32[3584]{0}, f32[3584]{0}, f32[3584]{0}, f32[224]{0}, f32[224]{0})}

%fused_computation.56 (param_0.57: f32[7,7,3,224], param_1.879: f32[7,7,3,224], param_2.767: s32[], param_3.773: f32[7,7,3,224]) -> (f32[7,7,3,224], f32[7,7,3,224]) {
  %param_0.57 = f32[7,7,3,224]{3,2,1,0} parameter(0)
  %param_2.767 = s32[] parameter(2)
  %convert.9 = f32[] convert(s32[] %param_2.767), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1062 = f32[] constant(50000)
  %compare.5 = pred[] compare(f32[] %convert.9, f32[] %constant_1062), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1061 = f32[] constant(1)
  %constant_1060 = s32[] constant(0)
  %maximum.4 = s32[] maximum(s32[] %param_2.767, s32[] %constant_1060), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.8 = f32[] convert(s32[] %maximum.4), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.9 = f32[] minimum(f32[] %convert.8, f32[] %constant_1062), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_1059 = f32[] constant(2e-05)
  %multiply.898 = f32[] multiply(f32[] %minimum.9, f32[] %constant_1059), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.4 = f32[] subtract(f32[] %constant_1061, f32[] %multiply.898), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_1058 = f32[] constant(-0.1)
  %multiply.897 = f32[] multiply(f32[] %subtract.4, f32[] %constant_1058), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1057 = f32[] constant(0.1)
  %add.268 = f32[] add(f32[] %multiply.897, f32[] %constant_1057), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1056 = f32[] constant(-50000)
  %add.267 = f32[] add(f32[] %convert.9, f32[] %constant_1056), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1055 = f32[] constant(950000)
  %minimum.8 = f32[] minimum(f32[] %add.267, f32[] %constant_1055), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_1054 = f32[] constant(3.30693956e-06)
  %multiply.896 = f32[] multiply(f32[] %minimum.8, f32[] %constant_1054), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.4 = f32[] cosine(f32[] %multiply.896), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.266 = f32[] add(f32[] %cosine.4, f32[] %constant_1061), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_1053 = f32[] constant(0.05)
  %multiply.895 = f32[] multiply(f32[] %add.266, f32[] %constant_1053), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.5 = f32[] select(pred[] %compare.5, f32[] %add.268, f32[] %multiply.895), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1052 = f32[] constant(-1)
  %multiply.894 = f32[] multiply(f32[] %select.5, f32[] %constant_1052), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/alias.py" source_line=37}
  %broadcast.196 = f32[7,7,3,224]{3,2,1,0} broadcast(f32[] %multiply.894), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %param_1.879 = f32[7,7,3,224]{3,2,1,0} parameter(1)
  %constant_1016 = f32[] constant(0.0625)
  %broadcast.903 = f32[7,7,3,224]{3,2,1,0} broadcast(f32[] %constant_1016), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div"}
  %multiply.878 = f32[7,7,3,224]{3,2,1,0} multiply(f32[7,7,3,224]{3,2,1,0} %param_1.879, f32[7,7,3,224]{3,2,1,0} %broadcast.903), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div"}
  %param_3.773 = f32[7,7,3,224]{3,2,1,0} parameter(3)
  %constant_214 = f32[] constant(0.9)
  %broadcast.364.clone.1 = f32[7,7,3,224]{3,2,1,0} broadcast(f32[] %constant_214), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.375.clone.1 = f32[7,7,3,224]{3,2,1,0} multiply(f32[7,7,3,224]{3,2,1,0} %param_3.773, f32[7,7,3,224]{3,2,1,0} %broadcast.364.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.173.clone.1 = f32[7,7,3,224]{3,2,1,0} add(f32[7,7,3,224]{3,2,1,0} %multiply.878, f32[7,7,3,224]{3,2,1,0} %multiply.375.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.203 = f32[7,7,3,224]{3,2,1,0} multiply(f32[7,7,3,224]{3,2,1,0} %add.173.clone.1, f32[7,7,3,224]{3,2,1,0} %broadcast.364.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.2 = f32[7,7,3,224]{3,2,1,0} add(f32[7,7,3,224]{3,2,1,0} %multiply.878, f32[7,7,3,224]{3,2,1,0} %multiply.203), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.202 = f32[7,7,3,224]{3,2,1,0} multiply(f32[7,7,3,224]{3,2,1,0} %broadcast.196, f32[7,7,3,224]{3,2,1,0} %add.2), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.1 = f32[7,7,3,224]{3,2,1,0} add(f32[7,7,3,224]{3,2,1,0} %param_0.57, f32[7,7,3,224]{3,2,1,0} %multiply.202), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  ROOT %tuple.67 = (f32[7,7,3,224]{3,2,1,0}, f32[7,7,3,224]{3,2,1,0}) tuple(f32[7,7,3,224]{3,2,1,0} %add.1, f32[7,7,3,224]{3,2,1,0} %add.173.clone.1)
}

%fused_computation.62 (param_0.63: f32[1,1,1792,3584], param_1.880: f32[1,1,1792,3584], param_2.768: s32[], param_3.774: f32[1,1,1792,3584], param_4.951: f32[1,1,1792,3584], param_5.633: f32[1,1,1792,3584], param_6.1149: f32[1,1,1792,3584]) -> (f32[1,1,1792,3584], f32[1,1,1792,3584], f32[1,1,1792,3584], f32[1,1,1792,3584]) {
  %param_0.63 = f32[1,1,1792,3584]{3,2,1,0} parameter(0)
  %param_2.768 = s32[] parameter(2)
  %convert.57 = f32[] convert(s32[] %param_2.768), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1338 = f32[] constant(50000)
  %compare.29 = pred[] compare(f32[] %convert.57, f32[] %constant_1338), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1337 = f32[] constant(1)
  %constant_1336 = s32[] constant(0)
  %maximum.28 = s32[] maximum(s32[] %param_2.768, s32[] %constant_1336), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.56 = f32[] convert(s32[] %maximum.28), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.57 = f32[] minimum(f32[] %convert.56, f32[] %constant_1338), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_1335 = f32[] constant(2e-05)
  %multiply.1018 = f32[] multiply(f32[] %minimum.57, f32[] %constant_1335), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.28 = f32[] subtract(f32[] %constant_1337, f32[] %multiply.1018), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_1334 = f32[] constant(-0.1)
  %multiply.1017 = f32[] multiply(f32[] %subtract.28, f32[] %constant_1334), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1333 = f32[] constant(0.1)
  %add.340 = f32[] add(f32[] %multiply.1017, f32[] %constant_1333), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1332 = f32[] constant(-50000)
  %add.339 = f32[] add(f32[] %convert.57, f32[] %constant_1332), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1331 = f32[] constant(950000)
  %minimum.56 = f32[] minimum(f32[] %add.339, f32[] %constant_1331), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_1330 = f32[] constant(3.30693956e-06)
  %multiply.1016 = f32[] multiply(f32[] %minimum.56, f32[] %constant_1330), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.28 = f32[] cosine(f32[] %multiply.1016), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.338 = f32[] add(f32[] %cosine.28, f32[] %constant_1337), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_1329 = f32[] constant(0.05)
  %multiply.1015 = f32[] multiply(f32[] %add.338, f32[] %constant_1329), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.29 = f32[] select(pred[] %compare.29, f32[] %add.340, f32[] %multiply.1015), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1328 = f32[] constant(-1)
  %multiply.1014 = f32[] multiply(f32[] %select.29, f32[] %constant_1328), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/alias.py" source_line=37}
  %broadcast.208 = f32[1,1,1792,3584]{3,2,1,0} broadcast(f32[] %multiply.1014), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %param_1.880 = f32[1,1,1792,3584]{3,2,1,0} parameter(1)
  %constant_980 = f32[] constant(0.0625)
  %broadcast.879 = f32[1,1,1792,3584]{3,2,1,0} broadcast(f32[] %constant_980), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div"}
  %multiply.854 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %param_1.880, f32[1,1,1792,3584]{3,2,1,0} %broadcast.879), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div"}
  %param_6.1149 = f32[1,1,1792,3584]{3,2,1,0} parameter(6)
  %constant_220 = f32[] constant(0.9)
  %broadcast.384.clone.1 = f32[1,1,1792,3584]{3,2,1,0} broadcast(f32[] %constant_220), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.387.clone.1 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %param_6.1149, f32[1,1,1792,3584]{3,2,1,0} %broadcast.384.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.179.clone.1 = f32[1,1,1792,3584]{3,2,1,0} add(f32[1,1,1792,3584]{3,2,1,0} %multiply.854, f32[1,1,1792,3584]{3,2,1,0} %multiply.387.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.215 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %add.179.clone.1, f32[1,1,1792,3584]{3,2,1,0} %broadcast.384.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.14 = f32[1,1,1792,3584]{3,2,1,0} add(f32[1,1,1792,3584]{3,2,1,0} %multiply.854, f32[1,1,1792,3584]{3,2,1,0} %multiply.215), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.214 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %broadcast.208, f32[1,1,1792,3584]{3,2,1,0} %add.14), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.13 = f32[1,1,1792,3584]{3,2,1,0} add(f32[1,1,1792,3584]{3,2,1,0} %param_0.63, f32[1,1,1792,3584]{3,2,1,0} %multiply.214), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  %param_3.774 = f32[1,1,1792,3584]{3,2,1,0} parameter(3)
  %param_4.951 = f32[1,1,1792,3584]{3,2,1,0} parameter(4)
  %multiply.858.clone.1 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %param_4.951, f32[1,1,1792,3584]{3,2,1,0} %broadcast.879), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div"}
  %param_5.633 = f32[1,1,1792,3584]{3,2,1,0} parameter(5)
  %multiply.385.clone.1 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %param_5.633, f32[1,1,1792,3584]{3,2,1,0} %broadcast.384.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.178.clone.1 = f32[1,1,1792,3584]{3,2,1,0} add(f32[1,1,1792,3584]{3,2,1,0} %multiply.858.clone.1, f32[1,1,1792,3584]{3,2,1,0} %multiply.385.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.213.clone.1 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %add.178.clone.1, f32[1,1,1792,3584]{3,2,1,0} %broadcast.384.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.12.clone.1 = f32[1,1,1792,3584]{3,2,1,0} add(f32[1,1,1792,3584]{3,2,1,0} %multiply.858.clone.1, f32[1,1,1792,3584]{3,2,1,0} %multiply.213.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.212.clone.1 = f32[1,1,1792,3584]{3,2,1,0} multiply(f32[1,1,1792,3584]{3,2,1,0} %broadcast.208, f32[1,1,1792,3584]{3,2,1,0} %add.12.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.11.clone.1 = f32[1,1,1792,3584]{3,2,1,0} add(f32[1,1,1792,3584]{3,2,1,0} %param_3.774, f32[1,1,1792,3584]{3,2,1,0} %multiply.212.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  ROOT %tuple.73 = (f32[1,1,1792,3584]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}) tuple(f32[1,1,1792,3584]{3,2,1,0} %add.13, f32[1,1,1792,3584]{3,2,1,0} %add.11.clone.1, f32[1,1,1792,3584]{3,2,1,0} %add.178.clone.1, f32[1,1,1792,3584]{3,2,1,0} %add.179.clone.1)
}

%fused_computation.63 (param_0.64: f32[3,3,896,1792], param_1.881: f32[3,3,896,1792], param_2.769: s32[], param_3.776: f32[3,3,896,1792]) -> (f32[3,3,896,1792], f32[3,3,896,1792]) {
  %param_0.64 = f32[3,3,896,1792]{3,2,1,0} parameter(0)
  %param_2.769 = s32[] parameter(2)
  %convert.61 = f32[] convert(s32[] %param_2.769), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1361 = f32[] constant(50000)
  %compare.31 = pred[] compare(f32[] %convert.61, f32[] %constant_1361), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1360 = f32[] constant(1)
  %constant_1359 = s32[] constant(0)
  %maximum.30 = s32[] maximum(s32[] %param_2.769, s32[] %constant_1359), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.60 = f32[] convert(s32[] %maximum.30), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.61 = f32[] minimum(f32[] %convert.60, f32[] %constant_1361), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_1358 = f32[] constant(2e-05)
  %multiply.1028 = f32[] multiply(f32[] %minimum.61, f32[] %constant_1358), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.30 = f32[] subtract(f32[] %constant_1360, f32[] %multiply.1028), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_1357 = f32[] constant(-0.1)
  %multiply.1027 = f32[] multiply(f32[] %subtract.30, f32[] %constant_1357), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1356 = f32[] constant(0.1)
  %add.346 = f32[] add(f32[] %multiply.1027, f32[] %constant_1356), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1355 = f32[] constant(-50000)
  %add.345 = f32[] add(f32[] %convert.61, f32[] %constant_1355), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1354 = f32[] constant(950000)
  %minimum.60 = f32[] minimum(f32[] %add.345, f32[] %constant_1354), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_1353 = f32[] constant(3.30693956e-06)
  %multiply.1026 = f32[] multiply(f32[] %minimum.60, f32[] %constant_1353), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.30 = f32[] cosine(f32[] %multiply.1026), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.344 = f32[] add(f32[] %cosine.30, f32[] %constant_1360), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_1352 = f32[] constant(0.05)
  %multiply.1025 = f32[] multiply(f32[] %add.344, f32[] %constant_1352), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.31 = f32[] select(pred[] %compare.31, f32[] %add.346, f32[] %multiply.1025), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1351 = f32[] constant(-1)
  %multiply.1024 = f32[] multiply(f32[] %select.31, f32[] %constant_1351), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/alias.py" source_line=37}
  %broadcast.210 = f32[3,3,896,1792]{3,2,1,0} broadcast(f32[] %multiply.1024), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %param_1.881 = f32[3,3,896,1792]{3,2,1,0} parameter(1)
  %constant_974 = f32[] constant(0.0625)
  %broadcast.875 = f32[3,3,896,1792]{3,2,1,0} broadcast(f32[] %constant_974), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div"}
  %multiply.850 = f32[3,3,896,1792]{3,2,1,0} multiply(f32[3,3,896,1792]{3,2,1,0} %param_1.881, f32[3,3,896,1792]{3,2,1,0} %broadcast.875), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div"}
  %param_3.776 = f32[3,3,896,1792]{3,2,1,0} parameter(3)
  %constant_221 = f32[] constant(0.9)
  %broadcast.388.clone.1 = f32[3,3,896,1792]{3,2,1,0} broadcast(f32[] %constant_221), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.389.clone.1 = f32[3,3,896,1792]{3,2,1,0} multiply(f32[3,3,896,1792]{3,2,1,0} %param_3.776, f32[3,3,896,1792]{3,2,1,0} %broadcast.388.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.180.clone.1 = f32[3,3,896,1792]{3,2,1,0} add(f32[3,3,896,1792]{3,2,1,0} %multiply.850, f32[3,3,896,1792]{3,2,1,0} %multiply.389.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.217 = f32[3,3,896,1792]{3,2,1,0} multiply(f32[3,3,896,1792]{3,2,1,0} %add.180.clone.1, f32[3,3,896,1792]{3,2,1,0} %broadcast.388.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.16 = f32[3,3,896,1792]{3,2,1,0} add(f32[3,3,896,1792]{3,2,1,0} %multiply.850, f32[3,3,896,1792]{3,2,1,0} %multiply.217), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.216 = f32[3,3,896,1792]{3,2,1,0} multiply(f32[3,3,896,1792]{3,2,1,0} %broadcast.210, f32[3,3,896,1792]{3,2,1,0} %add.16), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.15 = f32[3,3,896,1792]{3,2,1,0} add(f32[3,3,896,1792]{3,2,1,0} %param_0.64, f32[3,3,896,1792]{3,2,1,0} %multiply.216), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  ROOT %tuple.74 = (f32[3,3,896,1792]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}) tuple(f32[3,3,896,1792]{3,2,1,0} %add.15, f32[3,3,896,1792]{3,2,1,0} %add.180.clone.1)
}

%fused_computation.64 (param_0.65: f32[1,1,1792,896], param_1.882: f32[1,1,1792,896], param_2.770: s32[], param_3.778: f32[1,1,1792,896]) -> (f32[1,1,1792,896], f32[1,1,1792,896]) {
  %param_0.65 = f32[1,1,1792,896]{3,2,1,0} parameter(0)
  %param_2.770 = s32[] parameter(2)
  %convert.65 = f32[] convert(s32[] %param_2.770), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1384 = f32[] constant(50000)
  %compare.33 = pred[] compare(f32[] %convert.65, f32[] %constant_1384), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1383 = f32[] constant(1)
  %constant_1382 = s32[] constant(0)
  %maximum.32 = s32[] maximum(s32[] %param_2.770, s32[] %constant_1382), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.64 = f32[] convert(s32[] %maximum.32), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.65 = f32[] minimum(f32[] %convert.64, f32[] %constant_1384), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_1381 = f32[] constant(2e-05)
  %multiply.1038 = f32[] multiply(f32[] %minimum.65, f32[] %constant_1381), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.32 = f32[] subtract(f32[] %constant_1383, f32[] %multiply.1038), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_1380 = f32[] constant(-0.1)
  %multiply.1037 = f32[] multiply(f32[] %subtract.32, f32[] %constant_1380), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1379 = f32[] constant(0.1)
  %add.352 = f32[] add(f32[] %multiply.1037, f32[] %constant_1379), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1378 = f32[] constant(-50000)
  %add.351 = f32[] add(f32[] %convert.65, f32[] %constant_1378), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1377 = f32[] constant(950000)
  %minimum.64 = f32[] minimum(f32[] %add.351, f32[] %constant_1377), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_1376 = f32[] constant(3.30693956e-06)
  %multiply.1036 = f32[] multiply(f32[] %minimum.64, f32[] %constant_1376), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_0)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
