HloModule train_step_func_pipeshard_parallel_mesh_1-1, input_output_alias={ {0}: (0, {}, may-alias), {1}: (1, {}, may-alias), {2}: (2, {}, may-alias), {3}: (3, {}, may-alias), {4}: (4, {}, may-alias), {5}: (5, {}, may-alias), {6}: (6, {}, may-alias), {7}: (7, {}, may-alias), {8}: (8, {}, may-alias), {9}: (9, {}, may-alias), {10}: (10, {}, may-alias), {11}: (11, {}, may-alias), {12}: (12, {}, may-alias), {13}: (13, {}, may-alias), {14}: (14, {}, may-alias), {15}: (15, {}, may-alias), {16}: (16, {}, may-alias), {17}: (17, {}, may-alias), {18}: (18, {}, may-alias), {19}: (19, {}, may-alias), {20}: (20, {}, may-alias), {21}: (21, {}, may-alias), {22}: (22, {}, may-alias), {23}: (23, {}, may-alias), {24}: (24, {}, may-alias), {25}: (25, {}, may-alias), {26}: (26, {}, may-alias), {27}: (27, {}, may-alias), {28}: (28, {}, may-alias), {29}: (29, {}, may-alias), {30}: (30, {}, may-alias), {31}: (31, {}, may-alias), {32}: (32, {}, may-alias), {33}: (33, {}, may-alias), {34}: (34, {}, may-alias), {35}: (35, {}, may-alias), {36}: (36, {}, may-alias), {37}: (37, {}, may-alias), {38}: (38, {}, may-alias), {39}: (39, {}, may-alias), {40}: (40, {}, may-alias), {41}: (41, {}, may-alias), {42}: (42, {}, may-alias), {43}: (43, {}, may-alias), {44}: (44, {}, may-alias), {45}: (45, {}, may-alias), {46}: (46, {}, may-alias), {47}: (47, {}, may-alias), {48}: (48, {}, may-alias), {49}: (49, {}, may-alias), {50}: (50, {}, may-alias), {51}: (51, {}, may-alias), {52}: (52, {}, may-alias) }, entry_computation_layout={(f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[],f32[],f32[],f32[16,14,14,3584]{3,2,1,0},f32[1,1,3584,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[3,3,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[3,3,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[3,3,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[3,3,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[896]{0},f32[896]{0},f32[3,3,896,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[1,1,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3,3,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,7168]{3,2,1,0},f32[7168]{0},f32[7168]{0},f32[1,1,3584,7168]{3,2,1,0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3,3,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,7168]{3,2,1,0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3,3,1792,3584]{3,2,1,0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,7168]{3,2,1,0},f32[7168]{0},f32[7168]{0},f32[7168,1024]{1,0},f32[1024]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},s32[16]{0},s32[])->(f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=5*/f32[3584]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, /*index=10*/f32[3584]{0}, f32[3584]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=15*/f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[896]{0}, f32[896]{0}, /*index=20*/f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[896]{0}, /*index=25*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, /*index=30*/f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, /*index=35*/f32[7168]{0}, f32[7168]{0}, f32[7168]{0}, f32[1792]{0}, f32[1792]{0}, /*index=40*/f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, f32[1792]{0}, /*index=45*/f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, /*index=50*/f32[], f32[], f32[], f32[16,14,14,3584]{3,2,1,0}, f32[16,14,14,3584]{3,2,1,0}, /*index=55*/f32[16,14,14,3584]{3,2,1,0}, f32[16,14,14,3584]{3,2,1,0}, f32[16,14,14,3584]{3,2,1,0}, f32[16,7,7,7168]{3,2,1,0}, f32[16,7,7,7168]{3,2,1,0})}

%region_0.1142.1 (Arg_0.1143: f32[], Arg_1.1144: f32[]) -> f32[] {
  %Arg_0.1143 = f32[] parameter(0)
  %Arg_1.1144 = f32[] parameter(1)
  ROOT %add.1145 = f32[] add(f32[] %Arg_0.1143, f32[] %Arg_1.1144), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(10)/jvp(WideResNet)/BottleneckResNetBlock_8/BatchNorm_0/reduce_sum[axes=(0, 1, 2)]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
}

%fused_computation.2 (param_0.5: f32[], param_1.570: s32[]) -> f32[] {
  %param_0.5 = f32[] parameter(0)
  %param_1.570 = s32[] parameter(1)
  %convert.1 = f32[] convert(s32[] %param_1.570), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_90 = f32[] constant(50000)
  %compare.4 = pred[] compare(f32[] %convert.1, f32[] %constant_90), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_93 = f32[] constant(1)
  %constant_94 = s32[] constant(0)
  %maximum.0 = s32[] maximum(s32[] %param_1.570, s32[] %constant_94), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.0 = f32[] convert(s32[] %maximum.0), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.1 = f32[] minimum(f32[] %convert.0, f32[] %constant_90), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_89 = f32[] constant(2e-05)
  %multiply.137 = f32[] multiply(f32[] %minimum.1, f32[] %constant_89), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.0 = f32[] subtract(f32[] %constant_93, f32[] %multiply.137), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_88 = f32[] constant(-0.1)
  %multiply.136 = f32[] multiply(f32[] %subtract.0, f32[] %constant_88), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_95 = f32[] constant(0.1)
  %add.29 = f32[] add(f32[] %multiply.136, f32[] %constant_95), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_87 = f32[] constant(-50000)
  %add.28 = f32[] add(f32[] %convert.1, f32[] %constant_87), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_86 = f32[] constant(950000)
  %minimum.0 = f32[] minimum(f32[] %add.28, f32[] %constant_86), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_85 = f32[] constant(3.30693956e-06)
  %multiply.135 = f32[] multiply(f32[] %minimum.0, f32[] %constant_85), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.0 = f32[] cosine(f32[] %multiply.135), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.27 = f32[] add(f32[] %cosine.0, f32[] %constant_93), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_84 = f32[] constant(0.05)
  %multiply.134 = f32[] multiply(f32[] %add.27, f32[] %constant_84), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.1 = f32[] select(pred[] %compare.4, f32[] %add.29, f32[] %multiply.134), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  ROOT %add.26 = f32[] add(f32[] %param_0.5, f32[] %select.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/add"}
}

%fused_computation.6 (param_0.332: f32[16], param_1.721: s32[16], param_2.659: s32[16]) -> (f32[], f32[]) {
  %param_0.332 = f32[16]{0} parameter(0)
  %negate.1 = f32[16]{0} negate(f32[16]{0} %param_0.332), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/neg" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %constant_99 = f32[] constant(0)
  %reduce.262 = f32[] reduce(f32[16]{0} %negate.1, f32[] %constant_99), dimensions={0}, to_apply=%region_0.1142.1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/reduce_sum[axes=(0,)]" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=113}
  %param_1.721 = s32[16]{0} parameter(1)
  %param_2.659 = s32[16]{0} parameter(2)
  %compare.5.clone.1 = pred[16]{0} compare(s32[16]{0} %param_1.721, s32[16]{0} %param_2.659), direction=EQ, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/eq" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %convert.3.clone.1 = s32[16]{0} convert(pred[16]{0} %compare.5.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/convert_element_type[new_dtype=int32 weak_type=False]" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %convert.2.clone.1 = f32[16]{0} convert(s32[16]{0} %convert.3.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %reduce.261.clone.1 = f32[] reduce(f32[16]{0} %convert.2.clone.1, f32[] %constant_99), dimensions={0}, to_apply=%region_0.1142.1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/reduce_sum[axes=(0,)]" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  ROOT %tuple.94 = (f32[], f32[]) tuple(f32[] %reduce.262, f32[] %reduce.261.clone.1)
}

%fused_computation.7 (param_0.485: f32[16], param_1.632: s32[16], param_2.548: f32[16,1024], param_3.516: f32[16]) -> f32[16] {
  %param_1.632 = s32[16]{0} parameter(1)
  %broadcast.183 = s32[16,1024]{1,0} broadcast(s32[16]{0} %param_1.632), dimensions={0}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/eq" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/training/common_utils.py" source_line=102}
  %iota.6 = s32[16,1024]{1,0} iota(), iota_dimension=1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/eq" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/training/common_utils.py" source_line=102}
  %compare.6 = pred[16,1024]{1,0} compare(s32[16,1024]{1,0} %broadcast.183, s32[16,1024]{1,0} %iota.6), direction=EQ, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/eq" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/training/common_utils.py" source_line=102}
  %constant_100 = f32[] constant(1)
  %broadcast.182 = f32[16,1024]{1,0} broadcast(f32[] %constant_100), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/broadcast_in_dim[shape=(16, 1024) broadcast_dimensions=()]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/training/common_utils.py" source_line=103}
  %constant_101 = f32[] constant(0)
  %broadcast.181 = f32[16,1024]{1,0} broadcast(f32[] %constant_101), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/broadcast_in_dim[shape=(16, 1024) broadcast_dimensions=()]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/training/common_utils.py" source_line=103}
  %select.2 = f32[16,1024]{1,0} select(pred[16,1024]{1,0} %compare.6, f32[16,1024]{1,0} %broadcast.182, f32[16,1024]{1,0} %broadcast.181), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/training/common_utils.py" source_line=103}
  %param_2.548 = f32[16,1024]{1,0} parameter(2)
  %param_3.516 = f32[16]{0} parameter(3)
  %broadcast.644 = f32[16,1024]{1,0} broadcast(f32[16]{0} %param_3.516), dimensions={0}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %subtract.68 = f32[16,1024]{1,0} subtract(f32[16,1024]{1,0} %param_2.548, f32[16,1024]{1,0} %broadcast.644), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %param_0.485 = f32[16]{0} parameter(0)
  %broadcast.180 = f32[16,1024]{1,0} broadcast(f32[16]{0} %param_0.485), dimensions={0}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %subtract.1 = f32[16,1024]{1,0} subtract(f32[16,1024]{1,0} %subtract.68, f32[16,1024]{1,0} %broadcast.180), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %multiply.140 = f32[16,1024]{1,0} multiply(f32[16,1024]{1,0} %select.2, f32[16,1024]{1,0} %subtract.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  ROOT %reduce.263 = f32[16]{0} reduce(f32[16,1024]{1,0} %multiply.140, f32[] %constant_101), dimensions={1}, to_apply=%region_0.1142.1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/reduce_sum[axes=(1,)]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
}

%fused_computation.8 (param_0.483: f32[16,1024], param_1.630: f32[16]) -> f32[16] {
  %param_0.483 = f32[16,1024]{1,0} parameter(0)
  %param_1.630 = f32[16]{0} parameter(1)
  %broadcast.642 = f32[16,1024]{1,0} broadcast(f32[16]{0} %param_1.630), dimensions={0}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %subtract.66 = f32[16,1024]{1,0} subtract(f32[16,1024]{1,0} %param_0.483, f32[16,1024]{1,0} %broadcast.642), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %exponential.0 = f32[16,1024]{1,0} exponential(f32[16,1024]{1,0} %subtract.66), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/exp" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
  %constant_102 = f32[] constant(0)
  ROOT %reduce.264 = f32[16]{0} reduce(f32[16,1024]{1,0} %exponential.0, f32[] %constant_102), dimensions={1}, to_apply=%region_0.1142.1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/reduce_sum[axes=(1,)]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/loss.py" source_line=170}
}

%fused_computation (param_0.2: s32[], param_1.2: s32[], param_2.549: f32[], param_3.517: f32[]) -> (s32[], f32[]) {
  %param_2.549 = f32[] parameter(2)
  %param_3.517 = f32[] parameter(3)
  %compare.3.clone.1 = pred[] compare(f32[] %param_2.549, f32[] %param_3.517), direction=GT, metadata={op_name="/gt" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %compare.2.clone.1 = pred[] compare(f32[] %param_2.549, f32[] %param_2.549), direction=NE, metadata={op_name="/ne" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %or.1.clone.1 = pred[] or(pred[] %compare.3.clone.1, pred[] %compare.2.clone.1), metadata={op_name="/or" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %compare.1 = pred[] compare(f32[] %param_2.549, f32[] %param_3.517), direction=EQ, metadata={op_name="/eq" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %param_0.2 = s32[] parameter(0)
  %param_1.2 = s32[] parameter(1)
  %compare.0 = pred[] compare(s32[] %param_0.2, s32[] %param_1.2), direction=LT, metadata={op_name="/lt" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %and.0 = pred[] and(pred[] %compare.1, pred[] %compare.0), metadata={op_name="/and" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %or.0 = pred[] or(pred[] %or.1.clone.1, pred[] %and.0), metadata={op_name="/or" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %select.0 = s32[] select(pred[] %or.0, s32[] %param_0.2, s32[] %param_1.2), metadata={op_name="/select_n" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %select.3 = f32[] select(pred[] %or.1.clone.1, f32[] %param_2.549, f32[] %param_3.517), metadata={op_name="/select_n" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  ROOT %tuple.1 = (s32[], f32[]) tuple(s32[] %select.0, f32[] %select.3)
}

%region_55.2615.1 (Arg_0.2616: f32[], Arg_1.2617: s32[], Arg_2.2618: f32[], Arg_3.2619: s32[]) -> (f32[], s32[]) {
  %Arg_1.2617 = s32[] parameter(1)
  %Arg_3.2619 = s32[] parameter(3)
  %Arg_0.2616 = f32[] parameter(0)
  %Arg_2.2618 = f32[] parameter(2)
  %fusion = (s32[], f32[]) fusion(s32[] %Arg_1.2617, s32[] %Arg_3.2619, f32[] %Arg_0.2616, f32[] %Arg_2.2618), kind=kLoop, calls=%fused_computation, metadata={op_name="/select_n" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %get-tuple-element.87 = f32[] get-tuple-element((s32[], f32[]) %fusion), index=1
  %get-tuple-element.86 = s32[] get-tuple-element((s32[], f32[]) %fusion), index=0
  ROOT %tuple.2629 = (f32[], s32[]) tuple(f32[] %get-tuple-element.87, s32[] %get-tuple-element.86)
}

%fused_computation.10 (param_0.17: f32[16,1024]) -> (f32[16], s32[16]) {
  %param_0.17 = f32[16,1024]{1,0} parameter(0)
  %iota.7 = s32[16,1024]{1,0} iota(), iota_dimension=1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/iota[dtype=int32 shape=(16, 1024) dimension=1]" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
  %constant_91 = f32[] constant(-inf)
  %constant_103 = s32[] constant(0)
  ROOT %reduce.265 = (f32[16]{0}, s32[16]{0}) reduce(f32[16,1024]{1,0} %param_0.17, s32[16,1024]{1,0} %iota.7, f32[] %constant_91, s32[] %constant_103), dimensions={1}, to_apply=%region_55.2615.1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/reduce[computation=<function _compute_argminmax.<locals>.reducer_fn at 0x7f21c42cf5e0> consts=() dimensions=(1,)]" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/trainer/wide_resnet_trainer.py" source_line=183}
}

%fused_computation.11 (param_0.18: f32[16,7168]) -> f32[16,7168] {
  %param_0.18 = f32[16,7168]{1,0} parameter(0)
  %constant_92 = f32[] constant(0.0204081628)
  %broadcast.185 = f32[16,7168]{1,0} broadcast(f32[] %constant_92), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/div" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/model/wide_resnet.py" source_line=135}
  ROOT %multiply.141 = f32[16,7168]{1,0} multiply(f32[16,7168]{1,0} %param_0.18, f32[16,7168]{1,0} %broadcast.185), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/div" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/model/wide_resnet.py" source_line=135}
}

%fused_computation.13 (param_0.21: f32[7168], param_1.633: f32[7168], param_2.552: f32[7168], param_3.522: f32[16,7168], param_4.375: f32[7168], param_5.193: f32[7168]) -> (f32[7168], f32[7168], f32[7168]) {
  %param_0.21 = f32[7168]{0} parameter(0)
  %param_1.633 = f32[7168]{0} parameter(1)
  %constant_107 = f32[] constant(0.9)
  %broadcast.192 = f32[7168]{0} broadcast(f32[] %constant_107), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %multiply.145 = f32[7168]{0} multiply(f32[7168]{0} %param_1.633, f32[7168]{0} %broadcast.192), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=267}
  %param_3.522 = f32[16,7168]{1,0} parameter(3)
  %constant_109_clone_1 = f32[] constant(0)
  %reduce.267.clone.1 = f32[7168]{0} reduce(f32[16,7168]{1,0} %param_3.522, f32[] %constant_109_clone_1), dimensions={0}, to_apply=%region_0.1142.1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/reduce_sum[axes=(0, 1, 2)]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=83}
  %constant_717_clone_1 = f32[] constant(0.00127551018)
  %broadcast.194.clone.1 = f32[7168]{0} broadcast(f32[] %constant_717_clone_1), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_2/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %multiply.147.clone.1 = f32[7168]{0} multiply(f32[7168]{0} %reduce.267.clone.1, f32[7168]{0} %broadcast.194.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=83}
  %param_2.552 = f32[7168]{0} parameter(2)
  %multiply.527.clone.1 = f32[7168]{0} multiply(f32[7168]{0} %param_2.552, f32[7168]{0} %broadcast.194.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %multiply.146.clone.1 = f32[7168]{0} multiply(f32[7168]{0} %multiply.527.clone.1, f32[7168]{0} %multiply.527.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=46}
  %subtract.4.clone.1 = f32[7168]{0} subtract(f32[7168]{0} %multiply.147.clone.1, f32[7168]{0} %multiply.146.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=93}
  %broadcast.193.clone.1 = f32[7168]{0} broadcast(f32[] %constant_109_clone_1), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_2/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=93}
  %maximum.2.clone.1 = f32[7168]{0} maximum(f32[7168]{0} %subtract.4.clone.1, f32[7168]{0} %broadcast.193.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=93}
  %constant_106 = f32[] constant(0.1)
  %broadcast.191 = f32[7168]{0} broadcast(f32[] %constant_106), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %multiply.144 = f32[7168]{0} multiply(f32[7168]{0} %maximum.2.clone.1, f32[7168]{0} %broadcast.191), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=267}
  %add.36 = f32[7168]{0} add(f32[7168]{0} %multiply.145, f32[7168]{0} %multiply.144), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=267}
  %add.35 = f32[7168]{0} add(f32[7168]{0} %param_0.21, f32[7168]{0} %add.36), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/add"}
  %param_4.375 = f32[7168]{0} parameter(4)
  %param_5.193 = f32[7168]{0} parameter(5)
  %multiply.151.clone.1 = f32[7168]{0} multiply(f32[7168]{0} %param_5.193, f32[7168]{0} %broadcast.192), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %constant_112_clone_1 = f32[] constant(0.000127551015)
  %broadcast.196.clone.1 = f32[7168]{0} broadcast(f32[] %constant_112_clone_1), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %multiply.150.clone.1 = f32[7168]{0} multiply(f32[7168]{0} %param_2.552, f32[7168]{0} %broadcast.196.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %add.38.clone.1 = f32[7168]{0} add(f32[7168]{0} %multiply.151.clone.1, f32[7168]{0} %multiply.150.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_2/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %add.37.clone.1 = f32[7168]{0} add(f32[7168]{0} %param_4.375, f32[7168]{0} %add.38.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/add"}
  ROOT %tuple.3 = (f32[7168]{0}, f32[7168]{0}, f32[7168]{0}) tuple(f32[7168]{0} %add.35, f32[7168]{0} %maximum.2.clone.1, f32[7168]{0} %add.37.clone.1)
}

%fused_computation.19 (param_0.33: f32[3584], param_1.57: f32[3584], param_2.36: f32[3584], param_3.38: f32[16,7,7,3584], param_4.368: f32[3584]) -> f32[16,7,7,3584] {
  %param_3.38 = f32[16,7,7,3584]{2,1,3,0} parameter(3)
  %param_4.368 = f32[3584]{0} parameter(4)
  %constant_708 = f32[] constant(0.00127551018)
  %broadcast.634 = f32[3584]{0} broadcast(f32[] %constant_708), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_1/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %multiply.521 = f32[3584]{0} multiply(f32[3584]{0} %param_4.368, f32[3584]{0} %broadcast.634), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %broadcast.200 = f32[16,7,7,3584]{2,1,3,0} broadcast(f32[3584]{0} %multiply.521), dimensions={3}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=138}
  %subtract.5 = f32[16,7,7,3584]{2,1,3,0} subtract(f32[16,7,7,3584]{2,1,3,0} %param_3.38, f32[16,7,7,3584]{2,1,3,0} %broadcast.200), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=138}
  %param_2.36 = f32[3584]{0} parameter(2)
  %constant_115 = f32[] constant(1e-05)
  %broadcast.202 = f32[3584]{0} broadcast(f32[] %constant_115), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(10)/jvp(WideResNet)/BottleneckResNetBlock_8/BatchNorm_2/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=139}
  %add.40 = f32[3584]{0} add(f32[3584]{0} %param_2.36, f32[3584]{0} %broadcast.202), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=139}
  %rsqrt.26 = f32[3584]{0} rsqrt(f32[3584]{0} %add.40), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/rsqrt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=139}
  %param_1.57 = f32[3584]{0} parameter(1)
  %multiply.153 = f32[3584]{0} multiply(f32[3584]{0} %rsqrt.26, f32[3584]{0} %param_1.57), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=144}
  %broadcast.199 = f32[16,7,7,3584]{2,1,3,0} broadcast(f32[3584]{0} %multiply.153), dimensions={3}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=146}
  %multiply.152 = f32[16,7,7,3584]{2,1,3,0} multiply(f32[16,7,7,3584]{2,1,3,0} %subtract.5, f32[16,7,7,3584]{2,1,3,0} %broadcast.199), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=146}
  %param_0.33 = f32[3584]{0} parameter(0)
  %broadcast.198 = f32[16,7,7,3584]{2,1,3,0} broadcast(f32[3584]{0} %param_0.33), dimensions={3}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=150}
  %add.39 = f32[16,7,7,3584]{2,1,3,0} add(f32[16,7,7,3584]{2,1,3,0} %multiply.152, f32[16,7,7,3584]{2,1,3,0} %broadcast.198), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=150}
  %constant_116 = f32[] constant(0)
  %broadcast.201 = f32[16,7,7,3584]{2,1,3,0} broadcast(f32[] %constant_116), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/max" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/model/wide_resnet.py" source_line=88}
  ROOT %maximum.3 = f32[16,7,7,3584]{2,1,3,0} maximum(f32[16,7,7,3584]{2,1,3,0} %add.39, f32[16,7,7,3584]{2,1,3,0} %broadcast.201), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/max" source_file="/home/cyxue/Projects/crius/Crius/runtime/crius_worker/jax/model/wide_resnet.py" source_line=88}
}

%fused_computation.20 (param_0.34: f32[3584], param_1.636: f32[3584], param_2.556: f32[3584], param_3.527: f32[16,3584], param_4.381: f32[3584], param_5.200: f32[3584]) -> (f32[3584], f32[3584], f32[3584]) {
  %param_0.34 = f32[3584]{0} parameter(0)
  %param_1.636 = f32[3584]{0} parameter(1)
  %constant_118 = f32[] constant(0.9)
  %broadcast.204 = f32[3584]{0} broadcast(f32[] %constant_118), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(10)/jvp(WideResNet)/BottleneckResNetBlock_8/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %multiply.155 = f32[3584]{0} multiply(f32[3584]{0} %param_1.636, f32[3584]{0} %broadcast.204), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=267}
  %param_3.527 = f32[16,3584]{1,0} parameter(3)
  %constant_120_clone_1 = f32[] constant(0)
  %reduce.270.clone.1 = f32[3584]{0} reduce(f32[16,3584]{1,0} %param_3.527, f32[] %constant_120_clone_1), dimensions={0}, to_apply=%region_0.1142.1, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/reduce_sum[axes=(0, 1, 2)]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=83}
  %constant_711_clone_1 = f32[] constant(0.00127551018)
  %broadcast.205.clone.1 = f32[3584]{0} broadcast(f32[] %constant_711_clone_1), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_1/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %multiply.157.clone.1 = f32[3584]{0} multiply(f32[3584]{0} %reduce.270.clone.1, f32[3584]{0} %broadcast.205.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=83}
  %param_2.556 = f32[3584]{0} parameter(2)
  %multiply.523.clone.1 = f32[3584]{0} multiply(f32[3584]{0} %param_2.556, f32[3584]{0} %broadcast.205.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %multiply.156.clone.1 = f32[3584]{0} multiply(f32[3584]{0} %multiply.523.clone.1, f32[3584]{0} %multiply.523.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=46}
  %subtract.6.clone.1 = f32[3584]{0} subtract(f32[3584]{0} %multiply.157.clone.1, f32[3584]{0} %multiply.156.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=93}
  %broadcast.206.clone.1 = f32[3584]{0} broadcast(f32[] %constant_120_clone_1), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(10)/jvp(WideResNet)/BottleneckResNetBlock_8/BatchNorm_2/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=93}
  %maximum.4.clone.1 = f32[3584]{0} maximum(f32[3584]{0} %subtract.6.clone.1, f32[3584]{0} %broadcast.206.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=93}
  %constant_117 = f32[] constant(0.1)
  %broadcast.203 = f32[3584]{0} broadcast(f32[] %constant_117), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(10)/jvp(WideResNet)/BottleneckResNetBlock_8/BatchNorm_2/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %multiply.154 = f32[3584]{0} multiply(f32[3584]{0} %maximum.4.clone.1, f32[3584]{0} %broadcast.203), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=267}
  %add.42 = f32[3584]{0} add(f32[3584]{0} %multiply.155, f32[3584]{0} %multiply.154), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=267}
  %add.41 = f32[3584]{0} add(f32[3584]{0} %param_0.34, f32[3584]{0} %add.42), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/add"}
  %param_4.381 = f32[3584]{0} parameter(4)
  %param_5.200 = f32[3584]{0} parameter(5)
  %multiply.161.clone.1 = f32[3584]{0} multiply(f32[3584]{0} %param_5.200, f32[3584]{0} %broadcast.204), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %constant_123_clone_1 = f32[] constant(0.000127551015)
  %broadcast.208.clone.1 = f32[3584]{0} broadcast(f32[] %constant_123_clone_1), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(15)/jvp(WideResNet)/BottleneckResNetBlock_13/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %multiply.160.clone.1 = f32[3584]{0} multiply(f32[3584]{0} %param_2.556, f32[3584]{0} %broadcast.208.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %add.44.clone.1 = f32[3584]{0} add(f32[3584]{0} %multiply.161.clone.1, f32[3584]{0} %multiply.160.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_1/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=265}
  %add.43.clone.1 = f32[3584]{0} add(f32[3584]{0} %param_4.381, f32[3584]{0} %add.44.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/add"}
  ROOT %tuple.6 = (f32[3584]{0}, f32[3584]{0}, f32[3584]{0}) tuple(f32[3584]{0} %add.41, f32[3584]{0} %maximum.4.clone.1, f32[3584]{0} %add.43.clone.1)
}

%fused_computation.26 (param_0.46: f32[1792], param_1.78: f32[1792], param_2.55: f32[1792], param_3.57: f32[16,7,7,1792], param_4.367: f32[1792]) -> f32[16,7,7,1792] {
  %param_3.57 = f32[16,7,7,1792]{2,1,3,0} parameter(3)
  %param_4.367 = f32[1792]{0} parameter(4)
  %constant_702 = f32[] constant(0.00127551018)
  %broadcast.630 = f32[1792]{0} broadcast(f32[] %constant_702), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(16)/jvp(WideResNet)/BottleneckResNetBlock_14/BatchNorm_0/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %multiply.517 = f32[1792]{0} multiply(f32[1792]{0} %param_4.367, f32[1792]{0} %broadcast.630), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=82}
  %broadcast.212 = f32[16,7,7,1792]{2,1,3,0} broadcast(f32[1792]{0} %multiply.517), dimensions={3}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=138}
  %subtract.7 = f32[16,7,7,1792]{2,1,3,0} subtract(f32[16,7,7,1792]{2,1,3,0} %param_3.57, f32[16,7,7,1792]{2,1,3,0} %broadcast.212), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=138}
  %param_2.55 = f32[1792]{0} parameter(2)
  %constant_126 = f32[] constant(1e-05)
  %broadcast.214 = f32[1792]{0} broadcast(f32[] %constant_126), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(10)/jvp(WideResNet)/BottleneckResNetBlock_8/BatchNorm_1/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=139}
  %add.46 = f32[1792]{0} add(f32[1792]{0} %param_2.55, f32[1792]{0} %broadcast.214), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=139}
  %rsqrt.27 = f32[1792]{0} rsqrt(f32[1792]{0} %add.46), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/rsqrt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=139}
  %param_1.78 = f32[1792]{0} parameter(1)
  %multiply.163 = f32[1792]{0} multiply(f32[1792]{0} %rsqrt.27, f32[1792]{0} %param_1.78), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=144}
  %broadcast.211 = f32[16,7,7,1792]{2,1,3,0} broadcast(f32[1792]{0} %multiply.163), dimensions={3}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=146}
  %multiply.162 = f32[16,7,7,1792]{2,1,3,0} multiply(f32[16,7,7,1792]{2,1,3,0} %subtract.7, f32[16,7,7,1792]{2,1,3,0} %broadcast.211), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/jit(1)/jit(17)/jvp(WideResNet)/BottleneckResNetBlock_15/BatchNorm_0/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/flax/linen/normalization.py" source_line=146}
  %param_0.46 = f32[1792]{0} parameter(0)
