HloModule train_step_func_pipeshard_parallel_mesh_1-1_apply_grad, input_output_alias={ {0}: (0, {}, may-alias), {1}: (1, {}, may-alias), {2}: (2, {}, may-alias), {3}: (3, {}, may-alias), {4}: (4, {}, may-alias), {5}: (5, {}, may-alias), {6}: (6, {}, may-alias), {7}: (7, {}, may-alias), {8}: (8, {}, may-alias), {9}: (9, {}, may-alias), {10}: (10, {}, may-alias), {11}: (11, {}, may-alias), {12}: (12, {}, may-alias), {13}: (13, {}, may-alias), {14}: (14, {}, may-alias), {15}: (15, {}, may-alias), {16}: (16, {}, may-alias), {17}: (17, {}, may-alias), {18}: (18, {}, may-alias), {19}: (19, {}, may-alias), {20}: (20, {}, may-alias), {21}: (21, {}, may-alias), {22}: (22, {}, may-alias), {23}: (23, {}, may-alias), {24}: (24, {}, may-alias), {25}: (25, {}, may-alias), {26}: (26, {}, may-alias), {27}: (27, {}, may-alias), {28}: (28, {}, may-alias), {29}: (29, {}, may-alias), {30}: (30, {}, may-alias), {31}: (31, {}, may-alias), {32}: (32, {}, may-alias), {33}: (33, {}, may-alias), {34}: (34, {}, may-alias), {35}: (35, {}, may-alias), {36}: (36, {}, may-alias), {37}: (37, {}, may-alias), {38}: (38, {}, may-alias), {39}: (39, {}, may-alias), {40}: (40, {}, may-alias), {41}: (41, {}, may-alias), {42}: (42, {}, may-alias), {43}: (43, {}, may-alias), {44}: (44, {}, may-alias), {45}: (45, {}, may-alias), {46}: (46, {}, may-alias), {47}: (47, {}, may-alias), {48}: (48, {}, may-alias), {49}: (49, {}, may-alias), {50}: (50, {}, may-alias), {51}: (51, {}, may-alias), {52}: (52, {}, may-alias), {53}: (53, {}, may-alias), {54}: (54, {}, may-alias), {55}: (55, {}, may-alias), {56}: (56, {}, may-alias), {57}: (57, {}, may-alias), {58}: (58, {}, may-alias), {59}: (59, {}, may-alias), {60}: (60, {}, may-alias), {61}: (61, {}, may-alias), {62}: (62, {}, may-alias), {63}: (63, {}, may-alias), {64}: (64, {}, may-alias), {65}: (65, {}, may-alias), {66}: (66, {}, may-alias), {67}: (67, {}, may-alias), {68}: (68, {}, may-alias), {69}: (69, {}, may-alias), {70}: (70, {}, may-alias), {71}: (71, {}, may-alias), {72}: (72, {}, may-alias), {73}: (73, {}, may-alias), {74}: (74, {}, may-alias), {75}: (75, {}, may-alias), {76}: (76, {}, may-alias), {77}: (77, {}, may-alias), {78}: (78, {}, may-alias), {79}: (79, {}, may-alias), {80}: (80, {}, may-alias), {81}: (81, {}, may-alias), {82}: (82, {}, may-alias), {83}: (83, {}, may-alias), {84}: (84, {}, may-alias), {85}: (85, {}, may-alias), {86}: (86, {}, may-alias), {87}: (87, {}, may-alias), {88}: (88, {}, may-alias), {89}: (89, {}, may-alias), {90}: (90, {}, may-alias), {91}: (91, {}, may-alias), {92}: (92, {}, may-alias), {93}: (93, {}, may-alias), {94}: (94, {}, may-alias), {95}: (95, {}, may-alias), {96}: (96, {}, may-alias), {97}: (97, {}, may-alias), {98}: (98, {}, may-alias), {99}: (99, {}, may-alias), {100}: (100, {}, may-alias), {101}: (101, {}, may-alias), {102}: (102, {}, may-alias), {103}: (103, {}, may-alias), {104}: (104, {}, may-alias), {105}: (105, {}, may-alias), {106}: (106, {}, may-alias), {107}: (107, {}, may-alias), {108}: (108, {}, may-alias), {109}: (109, {}, may-alias), {110}: (110, {}, may-alias), {111}: (111, {}, may-alias), {112}: (112, {}, may-alias), {113}: (113, {}, may-alias), {114}: (114, {}, may-alias), {115}: (115, {}, may-alias), {116}: (116, {}, may-alias), {117}: (117, {}, may-alias), {118}: (118, {}, may-alias), {119}: (119, {}, may-alias), {120}: (120, {}, may-alias), {121}: (121, {}, may-alias), {122}: (122, {}, may-alias), {123}: (123, {}, may-alias), {124}: (124, {}, may-alias), {125}: (125, {}, may-alias), {126}: (126, {}, may-alias), {127}: (127, {}, may-alias), {128}: (128, {}, may-alias), {129}: (129, {}, may-alias), {130}: (130, {}, may-alias), {131}: (131, {}, may-alias), {132}: (132, {}, may-alias), {133}: (133, {}, may-alias), {134}: (134, {}, may-alias), {135}: (135, {}, may-alias), {136}: (136, {}, may-alias), {137}: (137, {}, may-alias), {138}: (138, {}, may-alias), {139}: (139, {}, may-alias), {140}: (140, {}, may-alias), {141}: (141, {}, may-alias), {142}: (142, {}, may-alias), {143}: (143, {}, may-alias), {144}: (144, {}, may-alias), {145}: (145, {}, may-alias), {146}: (146, {}, may-alias), {147}: (147, {}, may-alias), {148}: (148, {}, may-alias), {149}: (149, {}, may-alias), {150}: (150, {}, may-alias), {151}: (151, {}, may-alias), {152}: (152, {}, may-alias), {153}: (153, {}, may-alias), {154}: (154, {}, may-alias), {155}: (155, {}, may-alias), {156}: (156, {}, may-alias), {157}: (157, {}, may-alias), {158}: (158, {}, may-alias), {159}: (159, {}, may-alias), {160}: (160, {}, may-alias), {161}: (161, {}, may-alias), {162}: (162, {}, may-alias), {163}: (163, {}, may-alias), {164}: (164, {}, may-alias), {165}: (165, {}, may-alias), {166}: (166, {}, may-alias), {167}: (167, {}, may-alias), {168}: (168, {}, may-alias), {169}: (169, {}, may-alias), {170}: (170, {}, may-alias), {171}: (171, {}, may-alias), {172}: (172, {}, may-alias), {173}: (173, {}, may-alias), {174}: (174, {}, may-alias), {175}: (175, {}, may-alias), {176}: (176, {}, may-alias), {177}: (177, {}, may-alias), {178}: (178, {}, may-alias), {179}: (179, {}, may-alias), {180}: (180, {}, may-alias), {181}: (181, {}, may-alias), {182}: (182, {}, may-alias), {183}: (183, {}, may-alias), {184}: (184, {}, may-alias), {185}: (185, {}, may-alias), {186}: (186, {}, may-alias), {187}: (187, {}, may-alias), {188}: (188, {}, may-alias), {189}: (189, {}, may-alias), {190}: (190, {}, may-alias), {191}: (191, {}, may-alias), {192}: (192, {}, may-alias), {193}: (193, {}, may-alias), {194}: (194, {}, may-alias), {195}: (195, {}, may-alias), {196}: (196, {}, may-alias), {197}: (197, {}, may-alias), {198}: (198, {}, may-alias), {199}: (199, {}, may-alias), {200}: (200, {}, may-alias), {201}: (201, {}, may-alias), {202}: (202, {}, may-alias), {203}: (203, {}, may-alias), {204}: (204, {}, may-alias), {205}: (205, {}, may-alias) }, entry_computation_layout={(f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,3584,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1024]{0},f32[7168,1024]{1,0},s32[],f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,3584,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1024]{0},f32[7168,1024]{1,0},s32[],f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,3584,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1,1,7168,1792]{3,2,1,0},f32[3,3,1792,3584]{3,2,1,0},f32[1,1,3584,7168]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1,1,3584,896]{3,2,1,0},f32[3,3,896,1792]{3,2,1,0},f32[1,1,1792,3584]{3,2,1,0},f32[1024]{0},f32[7168,1024]{1,0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[7168]{0},f32[7168]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[896]{0},f32[896]{0},f32[1792]{0},f32[1792]{0},f32[3584]{0},f32[3584]{0},f32[],f32[],f32[])->(f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=5*/f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[896]{0}, /*index=10*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, /*index=15*/f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[896]{0}, f32[896]{0}, /*index=20*/f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, /*index=25*/f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=30*/f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, f32[1,1,3584,1792]{3,2,1,0}, f32[3,3,1792,3584]{3,2,1,0}, /*index=35*/f32[1,1,3584,7168]{3,2,1,0}, f32[1,1,3584,7168]{3,2,1,0}, f32[7168]{0}, f32[7168]{0}, f32[1792]{0}, /*index=40*/f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, /*index=45*/f32[1,1,7168,1792]{3,2,1,0}, f32[3,3,1792,3584]{3,2,1,0}, f32[1,1,3584,7168]{3,2,1,0}, f32[1792]{0}, f32[1792]{0}, /*index=50*/f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, f32[1,1,7168,1792]{3,2,1,0}, /*index=55*/f32[3,3,1792,3584]{3,2,1,0}, f32[1,1,3584,7168]{3,2,1,0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=60*/f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, /*index=65*/f32[1,1,1792,3584]{3,2,1,0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, /*index=70*/f32[3584]{0}, f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, /*index=75*/f32[1024]{0}, f32[7168,1024]{1,0}, s32[], f32[896]{0}, f32[896]{0}, /*index=80*/f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, /*index=85*/f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=90*/f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, /*index=95*/f32[1,1,1792,3584]{3,2,1,0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, /*index=100*/f32[3584]{0}, f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, /*index=105*/f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, /*index=110*/f32[7168]{0}, f32[1,1,3584,1792]{3,2,1,0}, f32[3,3,1792,3584]{3,2,1,0}, f32[1,1,3584,7168]{3,2,1,0}, f32[1,1,3584,7168]{3,2,1,0}, /*index=115*/f32[7168]{0}, f32[7168]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=120*/f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, f32[1,1,7168,1792]{3,2,1,0}, f32[3,3,1792,3584]{3,2,1,0}, /*index=125*/f32[1,1,3584,7168]{3,2,1,0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, /*index=130*/f32[7168]{0}, f32[7168]{0}, f32[1,1,7168,1792]{3,2,1,0}, f32[3,3,1792,3584]{3,2,1,0}, f32[1,1,3584,7168]{3,2,1,0}, /*index=135*/f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=140*/f32[3584]{0}, f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[896]{0}, /*index=145*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, /*index=150*/f32[1,1,3584,896]{3,2,1,0}, f32[3,3,896,1792]{3,2,1,0}, f32[1,1,1792,3584]{3,2,1,0}, f32[1024]{0}, f32[7168,1024]{1,0}, /*index=155*/s32[], f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, /*index=160*/f32[3584]{0}, f32[3584]{0}, f32[896]{0}, f32[896]{0}, f32[1792]{0}, /*index=165*/f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[896]{0}, f32[896]{0}, /*index=170*/f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[1792]{0}, /*index=175*/f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, /*index=180*/f32[7168]{0}, f32[7168]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=185*/f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, f32[1792]{0}, f32[1792]{0}, /*index=190*/f32[3584]{0}, f32[3584]{0}, f32[7168]{0}, f32[7168]{0}, f32[896]{0}, /*index=195*/f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, f32[3584]{0}, /*index=200*/f32[896]{0}, f32[896]{0}, f32[1792]{0}, f32[1792]{0}, f32[3584]{0}, /*index=205*/f32[3584]{0}, f32[], f32[], f32[])}

%fused_computation.50 (param_0.51: f32[7168,1024], param_1.805: f32[7168,1024], param_2.705: s32[], param_3.710: f32[7168,1024]) -> (f32[7168,1024], f32[7168,1024]) {
  %param_0.51 = f32[7168,1024]{1,0} parameter(0)
  %param_2.705 = s32[] parameter(2)
  %convert.9 = f32[] convert(s32[] %param_2.705), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_974 = f32[] constant(50000)
  %compare.5 = pred[] compare(f32[] %convert.9, f32[] %constant_974), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_973 = f32[] constant(1)
  %constant_972 = s32[] constant(0)
  %maximum.4 = s32[] maximum(s32[] %param_2.705, s32[] %constant_972), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.8 = f32[] convert(s32[] %maximum.4), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.9 = f32[] minimum(f32[] %convert.8, f32[] %constant_974), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_971 = f32[] constant(2e-05)
  %multiply.826 = f32[] multiply(f32[] %minimum.9, f32[] %constant_971), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.4 = f32[] subtract(f32[] %constant_973, f32[] %multiply.826), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_970 = f32[] constant(-0.1)
  %multiply.825 = f32[] multiply(f32[] %subtract.4, f32[] %constant_970), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_969 = f32[] constant(0.1)
  %add.247 = f32[] add(f32[] %multiply.825, f32[] %constant_969), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_968 = f32[] constant(-50000)
  %add.246 = f32[] add(f32[] %convert.9, f32[] %constant_968), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_967 = f32[] constant(950000)
  %minimum.8 = f32[] minimum(f32[] %add.246, f32[] %constant_967), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_966 = f32[] constant(3.30693956e-06)
  %multiply.824 = f32[] multiply(f32[] %minimum.8, f32[] %constant_966), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.4 = f32[] cosine(f32[] %multiply.824), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.245 = f32[] add(f32[] %cosine.4, f32[] %constant_973), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_965 = f32[] constant(0.05)
  %multiply.823 = f32[] multiply(f32[] %add.245, f32[] %constant_965), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.5 = f32[] select(pred[] %compare.5, f32[] %add.247, f32[] %multiply.823), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_964 = f32[] constant(-1)
  %multiply.822 = f32[] multiply(f32[] %select.5, f32[] %constant_964), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/alias.py" source_line=37}
  %broadcast.177 = f32[7168,1024]{1,0} broadcast(f32[] %multiply.822), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %param_1.805 = f32[7168,1024]{1,0} parameter(1)
  %constant_928 = f32[] constant(0.0625)
  %broadcast.818 = f32[7168,1024]{1,0} broadcast(f32[] %constant_928), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div"}
  %multiply.806 = f32[7168,1024]{1,0} multiply(f32[7168,1024]{1,0} %param_1.805, f32[7168,1024]{1,0} %broadcast.818), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div"}
  %param_3.710 = f32[7168,1024]{1,0} parameter(3)
  %constant_197 = f32[] constant(0.9)
  %broadcast.331.clone.1 = f32[7168,1024]{1,0} broadcast(f32[] %constant_197), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.345.clone.1 = f32[7168,1024]{1,0} multiply(f32[7168,1024]{1,0} %param_3.710, f32[7168,1024]{1,0} %broadcast.331.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.159.clone.1 = f32[7168,1024]{1,0} add(f32[7168,1024]{1,0} %multiply.806, f32[7168,1024]{1,0} %multiply.345.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.187 = f32[7168,1024]{1,0} multiply(f32[7168,1024]{1,0} %add.159.clone.1, f32[7168,1024]{1,0} %broadcast.331.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.2 = f32[7168,1024]{1,0} add(f32[7168,1024]{1,0} %multiply.806, f32[7168,1024]{1,0} %multiply.187), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.186 = f32[7168,1024]{1,0} multiply(f32[7168,1024]{1,0} %broadcast.177, f32[7168,1024]{1,0} %add.2), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.1 = f32[7168,1024]{1,0} add(f32[7168,1024]{1,0} %param_0.51, f32[7168,1024]{1,0} %multiply.186), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  ROOT %tuple.62 = (f32[7168,1024]{1,0}, f32[7168,1024]{1,0}) tuple(f32[7168,1024]{1,0} %add.1, f32[7168,1024]{1,0} %add.159.clone.1)
}

%fused_computation.51 (param_0.52: f32[1024], param_1.806: f32[1024], param_2.706: s32[], param_3.712: f32[1024]) -> (f32[1024], f32[1024]) {
  %param_0.52 = f32[1024]{0} parameter(0)
  %param_2.706 = s32[] parameter(2)
  %convert.17 = f32[] convert(s32[] %param_2.706), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1020 = f32[] constant(50000)
  %compare.9 = pred[] compare(f32[] %convert.17, f32[] %constant_1020), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1019 = f32[] constant(1)
  %constant_1018 = s32[] constant(0)
  %maximum.8 = s32[] maximum(s32[] %param_2.706, s32[] %constant_1018), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.16 = f32[] convert(s32[] %maximum.8), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.17 = f32[] minimum(f32[] %convert.16, f32[] %constant_1020), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_1017 = f32[] constant(2e-05)
  %multiply.846 = f32[] multiply(f32[] %minimum.17, f32[] %constant_1017), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.8 = f32[] subtract(f32[] %constant_1019, f32[] %multiply.846), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_1016 = f32[] constant(-0.1)
  %multiply.845 = f32[] multiply(f32[] %subtract.8, f32[] %constant_1016), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1015 = f32[] constant(0.1)
  %add.259 = f32[] add(f32[] %multiply.845, f32[] %constant_1015), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1014 = f32[] constant(-50000)
  %add.258 = f32[] add(f32[] %convert.17, f32[] %constant_1014), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1013 = f32[] constant(950000)
  %minimum.16 = f32[] minimum(f32[] %add.258, f32[] %constant_1013), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_1012 = f32[] constant(3.30693956e-06)
  %multiply.844 = f32[] multiply(f32[] %minimum.16, f32[] %constant_1012), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.8 = f32[] cosine(f32[] %multiply.844), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.257 = f32[] add(f32[] %cosine.8, f32[] %constant_1019), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_1011 = f32[] constant(0.05)
  %multiply.843 = f32[] multiply(f32[] %add.257, f32[] %constant_1011), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.9 = f32[] select(pred[] %compare.9, f32[] %add.259, f32[] %multiply.843), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1010 = f32[] constant(-1)
  %multiply.842 = f32[] multiply(f32[] %select.9, f32[] %constant_1010), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/alias.py" source_line=37}
  %broadcast.179 = f32[1024]{0} broadcast(f32[] %multiply.842), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %param_1.806 = f32[1024]{0} parameter(1)
  %constant_922 = f32[] constant(0.0625)
  %broadcast.814 = f32[1024]{0} broadcast(f32[] %constant_922), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div"}
  %multiply.802 = f32[1024]{0} multiply(f32[1024]{0} %param_1.806, f32[1024]{0} %broadcast.814), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div"}
  %param_3.712 = f32[1024]{0} parameter(3)
  %constant_198 = f32[] constant(0.9)
  %broadcast.333.clone.1 = f32[1024]{0} broadcast(f32[] %constant_198), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.347.clone.1 = f32[1024]{0} multiply(f32[1024]{0} %param_3.712, f32[1024]{0} %broadcast.333.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.160.clone.1 = f32[1024]{0} add(f32[1024]{0} %multiply.802, f32[1024]{0} %multiply.347.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.189 = f32[1024]{0} multiply(f32[1024]{0} %add.160.clone.1, f32[1024]{0} %broadcast.333.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.4 = f32[1024]{0} add(f32[1024]{0} %multiply.802, f32[1024]{0} %multiply.189), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.188 = f32[1024]{0} multiply(f32[1024]{0} %broadcast.179, f32[1024]{0} %add.4), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.3 = f32[1024]{0} add(f32[1024]{0} %param_0.52, f32[1024]{0} %multiply.188), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  ROOT %tuple.63 = (f32[1024]{0}, f32[1024]{0}) tuple(f32[1024]{0} %add.3, f32[1024]{0} %add.160.clone.1)
}

%fused_computation.81 (param_0.82: f32[1,1,7168,1792], param_1.807: f32[1,1,7168,1792], param_2.707: s32[], param_3.713: f32[1,1,7168,1792], param_4.875: f32[1,1,7168,1792], param_5.584: f32[1,1,7168,1792], param_6.1053: f32[1,1,7168,1792]) -> (f32[1,1,7168,1792], f32[1,1,7168,1792], f32[1,1,7168,1792], f32[1,1,7168,1792]) {
  %param_0.82 = f32[1,1,7168,1792]{3,2,1,0} parameter(0)
  %param_2.707 = s32[] parameter(2)
  %convert.53 = f32[] convert(s32[] %param_2.707), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1227 = f32[] constant(50000)
  %compare.27 = pred[] compare(f32[] %convert.53, f32[] %constant_1227), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1226 = f32[] constant(1)
  %constant_1225 = s32[] constant(0)
  %maximum.26 = s32[] maximum(s32[] %param_2.707, s32[] %constant_1225), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.52 = f32[] convert(s32[] %maximum.26), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.53 = f32[] minimum(f32[] %convert.52, f32[] %constant_1227), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_1224 = f32[] constant(2e-05)
  %multiply.936 = f32[] multiply(f32[] %minimum.53, f32[] %constant_1224), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.26 = f32[] subtract(f32[] %constant_1226, f32[] %multiply.936), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_1223 = f32[] constant(-0.1)
  %multiply.935 = f32[] multiply(f32[] %subtract.26, f32[] %constant_1223), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1222 = f32[] constant(0.1)
  %add.313 = f32[] add(f32[] %multiply.935, f32[] %constant_1222), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1221 = f32[] constant(-50000)
  %add.312 = f32[] add(f32[] %convert.53, f32[] %constant_1221), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1220 = f32[] constant(950000)
  %minimum.52 = f32[] minimum(f32[] %add.312, f32[] %constant_1220), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_1219 = f32[] constant(3.30693956e-06)
  %multiply.934 = f32[] multiply(f32[] %minimum.52, f32[] %constant_1219), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.26 = f32[] cosine(f32[] %multiply.934), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.311 = f32[] add(f32[] %cosine.26, f32[] %constant_1226), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_1218 = f32[] constant(0.05)
  %multiply.933 = f32[] multiply(f32[] %add.311, f32[] %constant_1218), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.27 = f32[] select(pred[] %compare.27, f32[] %add.313, f32[] %multiply.933), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1217 = f32[] constant(-1)
  %multiply.932 = f32[] multiply(f32[] %select.27, f32[] %constant_1217), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/alias.py" source_line=37}
  %broadcast.239 = f32[1,1,7168,1792]{3,2,1,0} broadcast(f32[] %multiply.932), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %param_1.807 = f32[1,1,7168,1792]{3,2,1,0} parameter(1)
  %constant_742 = f32[] constant(0.0625)
  %broadcast.694 = f32[1,1,7168,1792]{3,2,1,0} broadcast(f32[] %constant_742), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div"}
  %multiply.682 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %param_1.807, f32[1,1,7168,1792]{3,2,1,0} %broadcast.694), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div"}
  %param_6.1053 = f32[1,1,7168,1792]{3,2,1,0} parameter(6)
  %constant_228 = f32[] constant(0.9)
  %broadcast.419.clone.1 = f32[1,1,7168,1792]{3,2,1,0} broadcast(f32[] %constant_228), dimensions={}, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.407.clone.1 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %param_6.1053, f32[1,1,7168,1792]{3,2,1,0} %broadcast.419.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.190.clone.1 = f32[1,1,7168,1792]{3,2,1,0} add(f32[1,1,7168,1792]{3,2,1,0} %multiply.682, f32[1,1,7168,1792]{3,2,1,0} %multiply.407.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.249 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %add.190.clone.1, f32[1,1,7168,1792]{3,2,1,0} %broadcast.419.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.64 = f32[1,1,7168,1792]{3,2,1,0} add(f32[1,1,7168,1792]{3,2,1,0} %multiply.682, f32[1,1,7168,1792]{3,2,1,0} %multiply.249), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.248 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %broadcast.239, f32[1,1,7168,1792]{3,2,1,0} %add.64), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.63 = f32[1,1,7168,1792]{3,2,1,0} add(f32[1,1,7168,1792]{3,2,1,0} %param_0.82, f32[1,1,7168,1792]{3,2,1,0} %multiply.248), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  %param_3.713 = f32[1,1,7168,1792]{3,2,1,0} parameter(3)
  %param_4.875 = f32[1,1,7168,1792]{3,2,1,0} parameter(4)
  %multiply.718.clone.1 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %param_4.875, f32[1,1,7168,1792]{3,2,1,0} %broadcast.694), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div"}
  %param_5.584 = f32[1,1,7168,1792]{3,2,1,0} parameter(5)
  %multiply.389.clone.1 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %param_5.584, f32[1,1,7168,1792]{3,2,1,0} %broadcast.419.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.181.clone.1 = f32[1,1,7168,1792]{3,2,1,0} add(f32[1,1,7168,1792]{3,2,1,0} %multiply.718.clone.1, f32[1,1,7168,1792]{3,2,1,0} %multiply.389.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.231.clone.1 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %add.181.clone.1, f32[1,1,7168,1792]{3,2,1,0} %broadcast.419.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %add.46.clone.1 = f32[1,1,7168,1792]{3,2,1,0} add(f32[1,1,7168,1792]{3,2,1,0} %multiply.718.clone.1, f32[1,1,7168,1792]{3,2,1,0} %multiply.231.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=70}
  %multiply.230.clone.1 = f32[1,1,7168,1792]{3,2,1,0} multiply(f32[1,1,7168,1792]{3,2,1,0} %broadcast.239, f32[1,1,7168,1792]{3,2,1,0} %add.46.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/transform.py" source_line=694}
  %add.45.clone.1 = f32[1,1,7168,1792]{3,2,1,0} add(f32[1,1,7168,1792]{3,2,1,0} %param_3.713, f32[1,1,7168,1792]{3,2,1,0} %multiply.230.clone.1), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/update.py" source_line=43}
  ROOT %tuple.87 = (f32[1,1,7168,1792]{3,2,1,0}, f32[1,1,7168,1792]{3,2,1,0}, f32[1,1,7168,1792]{3,2,1,0}, f32[1,1,7168,1792]{3,2,1,0}) tuple(f32[1,1,7168,1792]{3,2,1,0} %add.63, f32[1,1,7168,1792]{3,2,1,0} %add.45.clone.1, f32[1,1,7168,1792]{3,2,1,0} %add.181.clone.1, f32[1,1,7168,1792]{3,2,1,0} %add.190.clone.1)
}

%fused_computation.91 (param_0.92: f32[1,1,3584,7168], param_1.808: f32[1,1,3584,7168], param_2.708: s32[], param_3.714: f32[1,1,3584,7168], param_4.876: f32[1,1,3584,7168], param_5.585: f32[1,1,3584,7168], param_6.1054: f32[1,1,3584,7168], param_7.797: f32[1,1,3584,7168], param_8.216: f32[1,1,3584,7168], param_9.118: f32[1,1,3584,7168], param_10.218: f32[1,1,3584,7168], param_11.219: f32[1,1,3584,7168], param_12.111: f32[1,1,3584,7168]) -> (f32[1,1,3584,7168], f32[1,1,3584,7168], f32[1,1,3584,7168], f32[1,1,3584,7168], f32[1,1,3584,7168], /*index=5*/f32[1,1,3584,7168], f32[1,1,3584,7168], f32[1,1,3584,7168]) {
  %param_0.92 = f32[1,1,3584,7168]{3,2,1,0} parameter(0)
  %param_2.708 = s32[] parameter(2)
  %convert.45 = f32[] convert(s32[] %param_2.708), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1181 = f32[] constant(50000)
  %compare.23 = pred[] compare(f32[] %convert.45, f32[] %constant_1181), direction=LT, metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/lt" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1180 = f32[] constant(1)
  %constant_1179 = s32[] constant(0)
  %maximum.22 = s32[] maximum(s32[] %param_2.708, s32[] %constant_1179), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/max" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %convert.44 = f32[] convert(s32[] %maximum.22), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/convert_element_type[new_dtype=float32 weak_type=True]" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %minimum.45 = f32[] minimum(f32[] %convert.44, f32[] %constant_1181), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=86}
  %constant_1178 = f32[] constant(2e-05)
  %multiply.916 = f32[] multiply(f32[] %minimum.45, f32[] %constant_1178), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %subtract.22 = f32[] subtract(f32[] %constant_1180, f32[] %multiply.916), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=87}
  %constant_1177 = f32[] constant(-0.1)
  %multiply.915 = f32[] multiply(f32[] %subtract.22, f32[] %constant_1177), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1176 = f32[] constant(0.1)
  %add.301 = f32[] add(f32[] %multiply.915, f32[] %constant_1176), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=88}
  %constant_1175 = f32[] constant(-50000)
  %add.300 = f32[] add(f32[] %convert.45, f32[] %constant_1175), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/sub" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1174 = f32[] constant(950000)
  %minimum.44 = f32[] minimum(f32[] %add.300, f32[] %constant_1174), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/min" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=235}
  %constant_1173 = f32[] constant(3.30693956e-06)
  %multiply.914 = f32[] multiply(f32[] %minimum.44, f32[] %constant_1173), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/div" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %cosine.22 = f32[] cosine(f32[] %multiply.914), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/cos" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %add.299 = f32[] add(f32[] %cosine.22, f32[] %constant_1180), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/add" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=236}
  %constant_1172 = f32[] constant(0.05)
  %multiply.913 = f32[] multiply(f32[] %add.299, f32[] %constant_1172), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/mul" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=238}
  %select.23 = f32[] select(pred[] %compare.23, f32[] %add.301, f32[] %multiply.913), metadata={op_name="parallelize(train_step_func_pipeshard_parallel_mesh_1)/jit(main)/select_n" source_file="/home/cyxue/miniconda3/envs/alpa/lib/python3.8/site-packages/optax/_src/schedule.py" source_line=394}
  %constant_1171 = f32[] constant(-1)
